Autodesk.Revit.DB.Architecture.ToposurfaceData.#ctor(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Creates a new ToposurfaceData class.
name:
The surface name.
points:
The surface points.
facets:
The surface facets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019